app/controllers/line_items_controller.rb

  def create
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? ORDER BY "products"."id" ASC LIMIT 1  [["id", 3]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Fri, 16 Nov 2018 11:32:56 UTC +00:00], ["updated_at", Fri, 16 Nov 2018 11:32:56 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "product_id", "updated_at") VALUES (?, ?, ?, ?)  [["cart_id", 1], ["created_at", Fri, 16 Nov 2018 11:32:56 UTC +00:00], ["product_id", 2], ["updated_at", Fri, 16 Nov 2018 11:32:56 UTC +00:00]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = 1  [["quantity", 2], ["updated_at", Fri, 16 Nov 2018 12:06:25 UTC +00:00]]