app/controllers/users_controller.rb

  def index
    @users = User.order(:name)
---
SELECT "users".* FROM "users" ORDER BY "users".name ASC

    def set_user
      @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1